#+LATEX_HEADER: \usepackage{graphicx}

** Convolution Example
- Time to process n data points via convolution in time domain grows at $n^{2}$ This is bad!
#+begin_src matlab :session
close all; 
clear all;
clc;

a = [1 2 3 4 5 6];
b = [1 1 1 1];

z = conv(a,b)  % <-- This is a LOT of steps

fft_a = fft(a)
fft_b = fft(b)

C = fft_a .* fft_b'

ifft(C)

#+end_src

#+RESULTS:
#+begin_example
close all;
clear all;
clc;

a = [1 2 3 4 5 6];
b = [1 1 1 1];

z = conv(a,b)  % <-- This is a LOT of steps

z =

     1     3     6    10    14    18    15    11     6

fft_a = fft(a)

fft_a =

  Columns 1 through 4

  21.0000 + 0.0000i  -3.0000 + 5.1962i  -3.0000 + 1.7321i  -3.0000 + 0.0000i

  Columns 5 through 6

  -3.0000 - 1.7321i  -3.0000 - 5.1962i
fft_b = fft(b)

fft_b =

     4     0     0     0

C = fft_a .* fft_b'

C =

  Columns 1 through 4

  84.0000 + 0.0000i -12.0000 +20.7846i -12.0000 + 6.9282i -12.0000 + 0.0000i
   0.0000 + 0.0000i   0.0000 + 0.0000i   0.0000 + 0.0000i   0.0000 + 0.0000i
   0.0000 + 0.0000i   0.0000 + 0.0000i   0.0000 + 0.0000i   0.0000 + 0.0000i
   0.0000 + 0.0000i   0.0000 + 0.0000i   0.0000 + 0.0000i   0.0000 + 0.0000i

  Columns 5 through 6

 -12.0000 - 6.9282i -12.0000 -20.7846i
   0.0000 + 0.0000i   0.0000 + 0.0000i
   0.0000 + 0.0000i   0.0000 + 0.0000i
   0.0000 + 0.0000i   0.0000 + 0.0000i

ifft(C)

ans =

  Columns 1 through 4

  21.0000 + 0.0000i  -3.0000 + 5.1962i  -3.0000 + 1.7321i  -3.0000 + 0.0000i
  21.0000 + 0.0000i  -3.0000 + 5.1962i  -3.0000 + 1.7321i  -3.0000 + 0.0000i
  21.0000 + 0.0000i  -3.0000 + 5.1962i  -3.0000 + 1.7321i  -3.0000 + 0.0000i
  21.0000 + 0.0000i  -3.0000 + 5.1962i  -3.0000 + 1.7321i  -3.0000 + 0.0000i

  Columns 5 through 6

  -3.0000 - 1.7321i  -3.0000 - 5.1962i
  -3.0000 - 1.7321i  -3.0000 - 5.1962i
  -3.0000 - 1.7321i  -3.0000 - 5.1962i
  -3.0000 - 1.7321i  -3.0000 - 5.1962i
'org_babel_eoe'

ans =

    'org_babel_eoe'
#+end_example

